{"name":"HabitBloom","elevator":null,"project":null,"description":"A visually soft, friendly habit-tracking app with daily, weekly, and monthly views.","budget":"unknown","revenue_model":"unknown","market_orientation":"unknown","personal":false,"current_prd":{"id":35,"product_id":56,"version_number":0,"is_editable":true,"elevator_pitch":"HabitBloom is a visually soft and friendly habit-tracking app designed to help users build positive routines. With intuitive daily, weekly, and monthly views, simple progress circles, and customizable habit cards, HabitBloom offers a minimal, motivational, and clutter-free experience to foster lasting habits and personal growth.","problem_statement":"Many individuals struggle with establishing and maintaining consistent habits due to overwhelming interfaces, lack of visual motivation, and difficulty in tracking progress effectively. Existing habit trackers often feel rigid, complex, or visually unappealing, leading to user disengagement and abandonment.","solution":"HabitBloom provides a visually soft, friendly, and minimal interface that simplifies habit tracking. It offers clear daily, weekly, and monthly progress views, motivating streak indicators, and customizable habit cards, fostering a positive and clutter-free environment for users to build and maintain healthy habits.","key_features":[{"feature_name":"Daily, Weekly, Monthly Views","feature_description":"Intuitive navigation to view habit progress across different timeframes."},{"feature_name":"Simple Progress Circles","feature_description":"Visually appealing circles that show completion percentage for each habit."},{"feature_name":"Streak Indicators","feature_description":"Indicators that highlight consecutive days of habit completion to motivate users."},{"feature_name":"Customizable Habit Cards","feature_description":"Personalized cards for each habit, allowing users to set names, icons, colors, and reminders."},{"feature_name":"User \u0026 Habit Management APIs","feature_description":"Backend APIs for managing user accounts, habit data, and progress tracking."},{"feature_name":"Scalable Cloud Infrastructure","feature_description":"Scalable cloud infrastructure to handle growing user base and data volume."},{"feature_name":"Data Security \u0026 Privacy","feature_description":"Secure data storage and transmission protocols to protect user information."},{"feature_name":"Admin Dashboard","feature_description":"Admin dashboard for managing users, monitoring system health, and content updates."},{"feature_name":"Customer Support Tools","feature_description":"Tools for customer support to assist users with account or habit-related issues."},{"feature_name":"Usage Analytics","feature_description":"Tracking of user engagement, habit completion rates, and feature usage."},{"feature_name":"Error Logging \u0026 Performance Monitoring","feature_description":"System for logging errors and performance metrics to ensure app stability."},{"feature_name":"Automated Deployment","feature_description":"Automated deployment pipelines for efficient updates and rollbacks."},{"feature_name":"Maintenance \u0026 Support Tools","feature_description":"Tools and processes for ongoing maintenance and support of the application."}],"user_flows":[{"steps":["User taps 'Add Habit' button","User enters habit name, frequency, and reminder settings","User selects icon and color for the habit card","User taps 'Save Habit'","System creates new habit entry and displays it on the dashboard"],"flow_name":"Adding a New Habit"},{"steps":["User views daily habit list","User taps on a habit card to mark it complete","System updates habit status, progress circle, and streak indicator","System records completion timestamp"],"flow_name":"Marking a Habit as Complete"},{"steps":["User navigates to the 'Weekly' view","System displays a summary of habit completion for the current week","User can scroll through past weeks to review progress"],"flow_name":"Viewing Habit Progress (Weekly)"},{"steps":["Admin logs into the admin dashboard","Admin navigates to 'User Management' section","Admin can view, edit, or deactivate user accounts","System updates user status in the database"],"flow_name":"Admin User Management"},{"steps":["Operations team accesses performance monitoring tools","System displays real-time metrics (CPU, memory, network usage)","Alerts are triggered for anomalies or thresholds breaches","Operations team investigates and resolves issues"],"flow_name":"System Performance Monitoring"}],"success_metrics":"Increase daily active users by 20% within the first six months. Achieve a 7-day habit retention rate of 60%. Maintain an average app store rating of 4.5 stars or higher. Reduce user-reported bugs by 15% quarter-over-quarter.","competitors":"Habitica, Streaks, Productive, Loop Habit Tracker, Fabulous, Todoist (with habit features)","vision":"To become the most beloved and visually calming habit-tracking application, empowering millions to effortlessly cultivate positive habits, achieve personal goals, and lead more fulfilling lives through a delightful and clutter-free digital experience.","target_audience":[{"name":"New Habit Formers","pain_points":"Overwhelmed by complex apps, difficulty staying consistent, lack of motivation, forgetting to track habits.","demographics":"Ages 20-40, tech-savvy, health-conscious, students and young professionals.","needs_and_goals":"Easy-to-use interface, visual motivation, gentle reminders, clear progress tracking."},{"name":"Consistent Habit Maintainers","pain_points":"Apps becoming cluttered over time, losing motivation after initial excitement, difficulty seeing long-term progress.","demographics":"Ages 25-50, professionals, parents, individuals seeking self-improvement.","needs_and_goals":"Long-term tracking, streak preservation, customizable views, minimal distractions."}],"phasing":[{"features":["Daily, Weekly, Monthly Views","Simple Progress Circles","Customizable Habit Cards","User \u0026 Habit Management APIs","Scalable Cloud Infrastructure","Data Security \u0026 Privacy"],"rationale":"This phase establishes the fundamental user experience, allowing users to create, track, and view their habits. It includes the essential backend and infrastructure to support these core functions securely, making it suitable for a compelling demo or a very early MVP launch.","phase_name":"Core Habit Tracking (MVP)"},{"features":["Streak Indicators","Error Logging \u0026 Performance Monitoring","Automated Deployment"],"rationale":"Building on the core functionality, this phase introduces motivational elements (streaks) to enhance user engagement. Crucially, it integrates essential monitoring and deployment tools, preparing the application for a more stable and iterative beta launch by allowing developers to quickly identify and address issues.","phase_name":"Engagement \u0026 Stability (Beta Launch)"},{"features":["Admin Dashboard","Customer Support Tools","Usage Analytics","Maintenance \u0026 Support Tools"],"rationale":"This final phase focuses on the tools required for comprehensive operational management, user support, and strategic growth. It enables administrators to manage the platform, support users effectively, gather insights into usage, and ensure the long-term health and evolution of HabitBloom for a full public launch.","phase_name":"Operational \u0026 Growth (Full Launch)"}],"design_principles":"Simplicity: Clean, uncluttered interface with intuitive interactions.\nPositivity \u0026 Encouragement: Gentle visual cues and motivational feedback to foster a positive habit-building experience.\nClarity \u0026 Focus: Clear presentation of progress, streaks, and habit information without overwhelming the user.\nCustomization: Empower users to personalize their habit cards and app experience to suit their individual needs.","user_personas":[{"name":"Anna, The Aspiring Achiever","goals":"Build consistent healthy habits (e.g., drink water, meditate), track progress visually, feel motivated without pressure.","age_role":"28, Marketing Coordinator","pain_points":"Forgetting to track habits, feeling overwhelmed by complex apps, losing motivation due to lack of visual feedback.","preferred_device":"Mobile (iOS/Android)"},{"name":"David, The Habit Builder","goals":"Establish new routines (e.g., exercise, learning), receive gentle reminders, easily customize habits to fit a busy schedule.","age_role":"35, Small Business Owner","pain_points":"Forgetting to start new habits, difficulty integrating new routines into a busy day, lack of clear guidance on habit setup.","preferred_device":"Mobile and Desktop"}],"user_journeys":[{"steps":[{"actor":"User","description":"Opens the app and lands on the Home screen (Daily View)."},{"actor":"System","description":"Displays customizable habit cards, including \"Drink Water,\" with a simple progress circle."},{"actor":"User","description":"Taps on the \"Drink Water\" habit card to mark a serving."},{"actor":"System","description":"Updates the progress circle for \"Drink Water\" and shows a positive visual confirmation. Updates streak indicator if applicable."},{"actor":"User","description":"Swipes to the Weekly View to see her overall progress for the week."},{"actor":"System","description":"Displays a summary of weekly habit progress with simple visual indicators."}],"context":"Anna wants to track her daily \"Drink Water\" habit and see her progress.","trigger":"Anna opens the app in the morning to log her first glass of water."},{"steps":[{"actor":"User","description":"Navigates to the 'Habits' section from the bottom tab navigation."},{"actor":"System","description":"Displays a list of existing habits and an 'Add New Habit' button."},{"actor":"User","description":"Taps 'Add New Habit'."},{"actor":"System","description":"Presents a form for creating a new habit, including fields for name, frequency (daily), reminders, and color customization."},{"actor":"User","description":"Enters 'Morning Stretch', sets it to daily, chooses a soft blue color, and sets a reminder for 7:00 AM."},{"actor":"System","description":"Confirms habit creation and adds 'Morning Stretch' to the user's habit list and Home screen."},{"actor":"User","description":"Returns to the Home screen to see the new 'Morning Stretch' habit card."},{"actor":"System","description":"Displays the new habit card with its chosen color and an empty progress circle."}],"context":"David wants to add a new habit, 'Morning Stretch', to his daily routine.","trigger":"David decides to incorporate a morning stretch routine into his day."}],"sitemap":"Home (Daily View, Weekly View, Monthly View)\nHabits (List of all habits, Add New Habit, Edit Habit)\nProgress (Detailed statistics and history)\nSettings (Profile, Notifications, App Preferences)","navigation_design":"Bottom Tab Navigation:\n- Home (Default view, showing daily/weekly/monthly progress)\n- Habits (Access to manage all habits)\n- Progress (View detailed statistics and history)\n- Settings (User profile and app preferences)\n\nIn-app navigation:\n- Swipe gestures for switching between daily, weekly, and monthly views on the Home screen.\n- Clear back buttons for navigating out of detail screens.","description":"","schema":{},"sample_data":[{"rows":[{"value":"1","column_name":"id"},{"value":"habit_hero","column_name":"username"},{"value":"hero@example.com","column_name":"email"},{"value":"hashed_password_1","column_name":"password_hash"},{"value":"2","column_name":"id"},{"value":"streak_master","column_name":"username"},{"value":"master@example.com","column_name":"email"},{"value":"hashed_password_2","column_name":"password_hash"}],"table_name":"User"},{"rows":[{"value":"1","column_name":"id"},{"value":"1","column_name":"user_id"},{"value":"Drink Water","column_name":"name"},{"value":"Drink 8 glasses of water daily","column_name":"description"},{"value":"daily","column_name":"frequency_type"},{"value":"1","column_name":"frequency_value"},{"value":"2023-01-01 00:00:00","column_name":"start_date"},{"value":"NULL","column_name":"end_date"},{"value":"2","column_name":"id"},{"value":"1","column_name":"user_id"},{"value":"Read Book","column_name":"name"},{"value":"Read for 30 minutes","column_name":"description"},{"value":"daily","column_name":"frequency_type"},{"value":"1","column_name":"frequency_value"},{"value":"2023-01-05 00:00:00","column_name":"start_date"},{"value":"NULL","column_name":"end_date"},{"value":"3","column_name":"id"},{"value":"2","column_name":"user_id"},{"value":"Exercise","column_name":"name"},{"value":"30 minutes of exercise","column_name":"description"},{"value":"weekly","column_name":"frequency_type"},{"value":"3","column_name":"frequency_value"},{"value":"2023-01-01 00:00:00","column_name":"start_date"},{"value":"NULL","column_name":"end_date"}],"table_name":"Habit"},{"rows":[{"value":"1","column_name":"id"},{"value":"1","column_name":"habit_id"},{"value":"2023-01-01 10:00:00","column_name":"log_date"},{"value":"TRUE","column_name":"is_completed"},{"value":"2","column_name":"id"},{"value":"1","column_name":"habit_id"},{"value":"2023-01-02 10:00:00","column_name":"log_date"},{"value":"TRUE","column_name":"is_completed"},{"value":"3","column_name":"id"},{"value":"1","column_name":"habit_id"},{"value":"2023-01-03 10:00:00","column_name":"log_date"},{"value":"FALSE","column_name":"is_completed"},{"value":"4","column_name":"id"},{"value":"2","column_name":"habit_id"},{"value":"2023-01-05 09:00:00","column_name":"log_date"},{"value":"TRUE","column_name":"is_completed"},{"value":"5","column_name":"id"},{"value":"3","column_name":"habit_id"},{"value":"2023-01-02 15:00:00","column_name":"log_date"},{"value":"TRUE","column_name":"is_completed"}],"table_name":"HabitLog"}],"mermaid_erd_diagram":"erDiagram\nUser {\n  INT id\n  VARCHAR username\n  VARCHAR email\n  VARCHAR password_hash\n}\nHabit {\n  INT id\n  INT user_id\n  VARCHAR name\n  TEXT description\n  VARCHAR frequency_type\n  INT frequency_value\n  TIMESTAMP start_date\n  TIMESTAMP end_date\n}\nHabitLog {\n  INT id\n  INT habit_id\n  TIMESTAMP log_date\n  BOOLEAN is_completed\n}\nUser ||--o{ Habit : \"has\"\nHabit ||--o{ HabitLog : \"logs\"","user_stories":[{"title":"View Daily Habit Progress","user_story":{"as_a":"user","i_want":"to see my daily habit progress at a glance","so_that":"I can easily track my accomplishments for the day and stay motivated."},"acceptance_criteria":["The app displays a daily view of all active habits.","Each habit card shows its current progress for the day.","The daily view is the default landing screen upon opening the app."]},{"title":"View Weekly Habit Progress","user_story":{"as_a":"user","i_want":"to review my habit progress over the week","so_that":"I can understand my consistency and identify areas for improvement."},"acceptance_criteria":["The app provides a weekly view summarizing habit completion.","Users can navigate between different weeks to review past progress.","The weekly view clearly indicates completed and incomplete habits for each day."]},{"title":"View Monthly Habit Progress","user_story":{"as_a":"user","i_want":"to see my long-term habit trends","so_that":"I can gain insights into my overall consistency and celebrate sustained progress."},"acceptance_criteria":["The app offers a monthly view displaying overall habit trends.","Users can see a high-level overview of their habit completion rates for the month.","The monthly view helps users identify long-term patterns and progress."]},{"title":"Visualize Habit Progress with Circles","user_story":{"as_a":"user","i_want":"to see my habit progress visually represented","so_that":"I can quickly understand my completion status and feel a sense of accomplishment."},"acceptance_criteria":["Each habit card displays a simple, visually soft progress circle.","The progress circle updates in real-time as the user marks habit steps complete.","The progress circle clearly indicates the completion percentage or status."]},{"title":"Track Habit Streaks","user_story":{"as_a":"user","i_want":"to see my consecutive habit completions","so_that":"I am motivated to maintain my habits and build consistency."},"acceptance_criteria":["The app displays a clear streak indicator for each habit.","The streak indicator updates automatically with each consecutive completion.","Users receive positive reinforcement for maintaining their streaks."]},{"title":"Customize Habit Cards","user_story":{"as_a":"user","i_want":"to personalize my habit cards","so_that":"they reflect my individual habits and preferences, making the app feel more engaging."},"acceptance_criteria":["Users can create new habit cards with custom names.","Users can select from a predefined set of icons for their habit cards.","Users can choose a custom color scheme for each habit card.","Users can set reminders for individual habits."]},{"title":"Add a New Habit","user_story":{"as_a":"user","i_want":"to easily add new habits to track","so_that":"I can quickly incorporate new goals into my routine without friction."},"acceptance_criteria":["The app provides an intuitive interface for adding new habits.","Users can easily input habit details such as name, frequency, and reminders.","The process for adding a new habit is quick and straightforward."]},{"title":"Mark Habit as Complete","user_story":{"as_a":"user","i_want":"to quickly mark a habit as complete","so_that":"I can easily log my progress and feel a sense of accomplishment."},"acceptance_criteria":["Users can tap on a habit card to mark it as complete for the day.","The system updates the habit's status, progress circle, and streak indicator immediately.","A positive visual confirmation is provided upon successful completion."]},{"title":"Admin User Management","user_story":{"as_a":"admin","i_want":"to manage user accounts","so_that":"I can provide support and maintain the integrity of the user base."},"acceptance_criteria":["Admins can log into a dedicated dashboard.","The dashboard provides tools for viewing and managing user accounts.","Admins can edit user information and deactivate accounts."]},{"title":"Monitor System Performance and Errors","user_story":{"as_a":"operations team member","i_want":"to monitor the application's performance and errors","so_that":"I can ensure system stability and quickly address any issues that arise."},"acceptance_criteria":["The system logs errors and performance metrics in real-time.","Operations team can access monitoring tools to view system health.","Alerts are triggered for critical issues or performance degradation."]},{"title":"Manage User Accounts via API","user_story":{"as_a":"developer","i_want":"to interact with user data programmatically","so_that":"I can build and maintain the frontend application efficiently and securely."},"acceptance_criteria":["The backend provides APIs for creating, retrieving, updating, and deleting user accounts.","The APIs securely handle user authentication and authorization.","The APIs are well-documented for frontend integration."]},{"title":"Manage Habit Data via API","user_story":{"as_a":"developer","i_want":"to interact with habit data programmatically","so_that":"I can implement habit tracking features and display user progress accurately."},"acceptance_criteria":["The backend provides APIs for creating, retrieving, updating, and deleting habit data.","The APIs support tracking habit completion and streak information.","The APIs are designed for efficient data storage and retrieval."]},{"title":"Ensure Scalable Cloud Infrastructure","user_story":{"as_a":"operations team member","i_want":"to ensure the application can handle increased load","so_that":"users experience consistent performance even as the user base grows."},"acceptance_criteria":["The application is deployed on a scalable cloud infrastructure.","The infrastructure can handle a growing user base and increasing data volume.","The system is designed for high availability and fault tolerance."]},{"title":"Protect User Data Security and Privacy","user_story":{"as_a":"user","i_want":"my personal and habit data to be secure and private","so_that":"I can trust the application with my sensitive information."},"acceptance_criteria":["User data is stored and transmitted using secure protocols (e.g., encryption).","The application adheres to privacy regulations (e.g., GDPR, CCPA).","Regular security audits are conducted to identify and address vulnerabilities."]},{"title":"Admin Content Management","user_story":{"as_a":"admin","i_want":"to manage application content","so_that":"I can keep the app fresh and engaging for users without developer intervention."},"acceptance_criteria":["The admin dashboard allows for managing application content (e.g., predefined habit icons, motivational messages).","Admins can update content without requiring a new app deployment.","Content changes are reflected immediately for users."]},{"title":"Provide Customer Support Tools","user_story":{"as_a":"customer support agent","i_want":"to efficiently assist users with their inquiries","so_that":"users receive prompt and effective help, improving their overall experience."},"acceptance_criteria":["Customer support tools provide access to user account and habit data (with appropriate privacy controls).","Support agents can view user issues and provide timely assistance.","The tools facilitate communication between support and users."]},{"title":"Track Usage Analytics","user_story":{"as_a":"product manager","i_want":"to understand user behavior and app performance","so_that":"I can make data-driven decisions to improve the product and user experience."},"acceptance_criteria":["The system tracks key user engagement metrics (e.g., daily active users, session duration).","The system tracks habit completion rates and streak statistics.","Analytics data is presented in a dashboard for product managers and stakeholders."]},{"title":"Automate Deployment Process","user_story":{"as_a":"operations team member","i_want":"to deploy updates quickly and reliably","so_that":"users receive new features and bug fixes without disruption."},"acceptance_criteria":["Automated deployment pipelines are in place for continuous integration and delivery.","New updates can be deployed efficiently and with minimal downtime.","Rollback mechanisms are available in case of deployment issues."]},{"title":"Provide Ongoing Maintenance and Support","user_story":{"as_a":"operations team member","i_want":"to ensure the long-term health and stability of the application","so_that":"users can rely on a consistently performing and secure habit tracking experience."},"acceptance_criteria":["The application has defined processes and tools for ongoing maintenance.","Regular security patches and software updates are applied.","A support team is available to address critical issues and provide assistance."]}],"project_manager_score":10,"designer_score":10,"architect_score":10,"product_manager_score":10,"story_point_table":[],"effort_by_role_summary":{},"total_days_without_rhino":"","total_days_with_rhino":"","time_estimated_without_rhino":{},"time_estimated_with_rhino":{},"estimate_generated":false,"industry_category":"Health \u0026 Wellness Technology / Productivity Software","geographic_scope":"Global","tam_description":"Total Addressable Market for the Global Digital Health \u0026 Wellness Applications, encompassing all mobile and web-based solutions aimed at improving personal well-being, productivity, and self-improvement.","tam_estimated_value_usd":"500000000000.0","tam_estimation_basis":"Top-down approach, considering the broad market for digital health, wellness, and productivity applications.","tam_source":"Assumed from general market reports on Digital Health Market, Wellness Apps Market (e.g., Statista, Grand View Research).","sam_description":"Serviceable Available Market for Global Habit Tracking \u0026 Self-Improvement Applications, representing the segment of digital health and wellness apps specifically focused on habit formation, tracking, and personal growth tools.","sam_estimated_value_usd":"35000000000.0","sam_estimation_basis":"Estimated as a subset (7%) of the broader Digital Health \u0026 Wellness market, focusing on the specific niche of habit tracking and self-improvement.","sam_source":"Assumed from market segmentation within Digital Health \u0026 Wellness reports.","som_description":"Serviceable Obtainable Market for HabitBloom, representing the realistic market share that HabitBloom can capture within the Global Habit Tracking \u0026 Self-Improvement App Market over a 5-year horizon, considering its unique visual appeal and user experience.","som_estimated_value_usd":"350000000.0","som_estimation_basis":"Conservative 1% market share estimate over 5 years, considering the competitive landscape and HabitBloom's differentiated 'visually soft and friendly' approach targeting users overwhelmed by complex apps.","som_source":"Competitive analysis of existing habit trackers and new app market entry success rates.","avg_revenue_per_user_per_year":"25.0","expected_market_penetration_percent":"1.0","time_horizon_years":5,"customer_type":"","pricing_model_basis":"Freemium with a subscription for premium features (e.g., unlimited habits, advanced analytics, custom themes).","key_competitors":["Habitica","Streaks","Productive","Loop Habit Tracker","Fabulous","Todoist (with habit features)"],"industry_growth_rate_cagr_percent":"15.0","advantage_summary":"Visually soft, friendly, and minimal interface; intuitive daily, weekly, and monthly views; simple progress circles; customizable habit cards; clutter-free experience; focus on motivation and lasting habits.","market_sizing_generated":true,"created_at":"2025-11-25T17:39:06.757Z","updated_at":"2025-12-02T13:41:53.418Z","edit_mode":false,"current_edit_id":0,"version_name":"base_version","ai_statuses":{"edit":0,"generation":0,"post_processing":{"phasing":0,"reflection":0,"market_sizing":0,"scoping_estimator":1}},"ai_errors":{"edit":"","generation":"","post_processing":{"phasing":"","reflection":"","market_sizing":"","scoping_estimator":""}},"progress":{"prd_generation":100.0,"ui_prototype":false,"rhino_modules":false,"deployed":false},"planning":{"stage":"user_personas","stage_status":"generating","user_personas":null,"user_stories":null,"rhino_modules":{"planned":["rhino_core","rhino_organizations"]},"data_model":{"planned":[{"model":"Habit","table":"habits","columns":[{"name":"name","type":"string"},{"name":"description","type":"text"},{"name":"frequency_type","type":"string"},{"name":"frequency_value","type":"jsonb"},{"name":"icon_name","type":"string"},{"name":"color_scheme","type":"string"},{"name":"start_date","type":"date"},{"name":"active","type":"boolean"},{"name":"user_id","type":"bigint"},{"name":"organization_id","type":"bigint"}],"rhino_owner":"organization","validations":["validates :name, presence: true","validates :frequency_type, presence: true, inclusion: { in: %w[daily weekly custom] }","validates :start_date, presence: true"],"associations":[{"name":"user","type":"belongs_to"},{"name":"organization","type":"belongs_to"},{"name":"habit_completions","type":"has_many"}],"model_content":"class Habit \u003c ApplicationRecord\n  belongs_to :user\n  belongs_to :organization\n  has_many :habit_completions, dependent: :destroy\n\n  validates :name, presence: true\n  validates :frequency_type, presence: true, inclusion: { in: %w[daily weekly custom] }\n  validates :start_date, presence: true\n\n  rhino_owner :organization\n  rhino_references [:organization, :user]\nend","migration_content":"class CreateHabits \u003c ActiveRecord::Migration[7.2]\n  def change\n    create_table :habits do |t|\n      t.string :name, null: false\n      t.text :description\n      t.string :frequency_type, null: false\n      t.jsonb :frequency_value, default: {}\n      t.string :icon_name\n      t.string :color_scheme\n      t.date :start_date, null: false\n      t.boolean :active, default: true\n\n      t.references :user, null: false, foreign_key: true\n      t.references :organization, null: false, foreign_key: true\n\n      t.timestamps\n    end\n  end\nend","rails_model_generation_command_line":"rails generate model Habit name:string description:text frequency_type:string frequency_value:jsonb icon_name:string color_scheme:string start_date:date active:boolean user:references organization:references"},{"model":"HabitCompletion","table":"habit_completions","columns":[{"name":"completion_date","type":"date"},{"name":"status","type":"string"},{"name":"habit_id","type":"bigint"}],"rhino_owner":"habit","validations":["validates :completion_date, presence: true","validates :status, presence: true, inclusion: { in: %w[completed skipped missed] }","validates :completion_date, uniqueness: { scope: :habit_id, message: \"has already been recorded for this habit\" }"],"associations":[{"name":"habit","type":"belongs_to"}],"model_content":"class HabitCompletion \u003c ApplicationRecord\n  belongs_to :habit\n\n  validates :completion_date, presence: true\n  validates :status, presence: true, inclusion: { in: %w[completed skipped missed] }\n  validates :completion_date, uniqueness: { scope: :habit_id, message: \"has already been recorded for this habit\" }\n\n  rhino_owner :habit\n  rhino_references [:habit]\nend","migration_content":"class CreateHabitCompletions \u003c ActiveRecord::Migration[7.2]\n  def change\n    create_table :habit_completions do |t|\n      t.date :completion_date, null: false\n      t.string :status, null: false, default: \"completed\"\n\n      t.references :habit, null: false, foreign_key: true\n\n      t.timestamps\n    end\n    add_index :habit_completions, [:habit_id, :completion_date], unique: true\n  end\nend","rails_model_generation_command_line":"rails generate model HabitCompletion completion_date:date status:string habit:references"},{"model":"Icon","table":"icons","columns":[{"name":"name","type":"string"}],"rhino_owner":"global","validations":["validates :name, presence: true, uniqueness: true","validates :image, presence: true"],"associations":[{"name":"image","type":"has_one_attached"}],"model_content":"class Icon \u003c ApplicationRecord\n  has_one_attached :image\n\n  validates :name, presence: true, uniqueness: true\n  validates :image, presence: true\n\n  rhino_owner_global\nend","migration_content":"class CreateIcons \u003c ActiveRecord::Migration[7.2]\n  def change\n    create_table :icons do |t|\n      t.string :name, null: false, index: { unique: true }\n\n      t.timestamps\n    end\n  end\nend","rails_model_generation_command_line":"rails generate model Icon name:string"},{"model":"MotivationalMessage","table":"motivational_messages","columns":[{"name":"content","type":"text"}],"rhino_owner":"global","validations":["validates :content, presence: true, uniqueness: true"],"associations":[],"model_content":"class MotivationalMessage \u003c ApplicationRecord\n  validates :content, presence: true, uniqueness: true\n\n  rhino_owner_global\nend","migration_content":"class CreateMotivationalMessages \u003c ActiveRecord::Migration[7.2]\n  def change\n    create_table :motivational_messages do |t|\n      t.text :content, null: false, index: { unique: true }\n\n      t.timestamps\n    end\n  end\nend","rails_model_generation_command_line":"rails generate model MotivationalMessage content:text"},{"model":"User","provided_by":"rhino_project_core"},{"model":"Organization","provided_by":"rhino_project_organizations"},{"model":"Role","provided_by":"rhino_project_organizations"},{"model":"UsersRole","provided_by":"rhino_project_organizations"}]}}}}